Benchmark_tests/ycsb/workloadC/thread_16.txt
Adding shard node URL: jdbc:mysql://35.239.24.62:3306/database_2
Adding shard node URL: jdbc:mysql://35.239.24.62:3306/database_2
Adding shard node URL: jdbc:mysql://35.239.24.62:3306/database_2
[...]
Using shards: 1, batchSize:1000, fetchSize: 1000
Using shards: 1, batchSize:1000, fetchSize: 1000
Using shards: 1, batchSize:1000, fetchSize: 1000
[...]
[OVERALL], RunTime(ms), 31968
[OVERALL], Throughput(ops/sec), 31.28128128128128
[TOTAL_GCS_G1_Young_Generation], Count, 3
[TOTAL_GC_TIME_G1_Young_Generation], Time(ms), 39
[TOTAL_GC_TIME_%_G1_Young_Generation], Time(%), 0.121996996996997
[TOTAL_GCS_G1_Old_Generation], Count, 0
[TOTAL_GC_TIME_G1_Old_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Old_Generation], Time(%), 0.0
[TOTAL_GCs], Count, 3
[TOTAL_GC_TIME], Time(ms), 39
[TOTAL_GC_TIME_%], Time(%), 0.121996996996997
[READ], Operations, 1000
[READ], AverageLatency(us), 392443.776
[READ], MinLatency(us), 296192
[READ], MaxLatency(us), 851455
[READ], 95thPercentileLatency(us), 695295
[READ], 99thPercentileLatency(us), 818175
[READ], Return=OK, 1000
[CLEANUP], Operations, 16
[CLEANUP], AverageLatency(us), 989024.0
[CLEANUP], MinLatency(us), 817152
[CLEANUP], MaxLatency(us), 1229823
[CLEANUP], 95thPercentileLatency(us), 1228799
[CLEANUP], 99thPercentileLatency(us), 1229823