Benchmark_tests/ycsb/workloadC/thread_32.txt
Adding shard node URL: jdbc:mysql://35.239.24.62:3306/database_2
Adding shard node URL: jdbc:mysql://35.239.24.62:3306/database_2
Adding shard node URL: jdbc:mysql://35.239.24.62:3306/database_2
[...]
Using shards: 1, batchSize:1000, fetchSize: 1000
Using shards: 1, batchSize:1000, fetchSize: 1000
Using shards: 1, batchSize:1000, fetchSize: 1000
[...]
[OVERALL], RunTime(ms), 19407
[OVERALL], Throughput(ops/sec), 51.527799247694134
[TOTAL_GCS_G1_Young_Generation], Count, 3
[TOTAL_GC_TIME_G1_Young_Generation], Time(ms), 20
[TOTAL_GC_TIME_%_G1_Young_Generation], Time(%), 0.10305559849538826
[TOTAL_GCS_G1_Old_Generation], Count, 0
[TOTAL_GC_TIME_G1_Old_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Old_Generation], Time(%), 0.0
[TOTAL_GCs], Count, 3
[TOTAL_GC_TIME], Time(ms), 20
[TOTAL_GC_TIME_%], Time(%), 0.10305559849538826
[READ], Operations, 1000
[READ], AverageLatency(us), 424499.84
[READ], MinLatency(us), 302336
[READ], MaxLatency(us), 1315839
[READ], 95thPercentileLatency(us), 639487
[READ], 99thPercentileLatency(us), 690175
[READ], Return=OK, 1000
[CLEANUP], Operations, 32
[CLEANUP], AverageLatency(us), 670800.0
[CLEANUP], MinLatency(us), 651264
[CLEANUP], MaxLatency(us), 691199
[CLEANUP], 95thPercentileLatency(us), 684543
[CLEANUP], 99thPercentileLatency(us), 691199