Benchmark_tests/ycsb/workloadC/thread_4.txt
Adding shard node URL: jdbc:mysql://35.239.24.62:3306/database_2
Adding shard node URL: jdbc:mysql://35.239.24.62:3306/database_2
Adding shard node URL: jdbc:mysql://35.239.24.62:3306/database_2
[...]
Using shards: 1, batchSize:1000, fetchSize: 1000
Using shards: 1, batchSize:1000, fetchSize: 1000
Using shards: 1, batchSize:1000, fetchSize: 1000
[...]
[OVERALL], RunTime(ms), 129775
[OVERALL], Throughput(ops/sec), 7.705644384511655
[TOTAL_GCS_G1_Young_Generation], Count, 3
[TOTAL_GC_TIME_G1_Young_Generation], Time(ms), 81
[TOTAL_GC_TIME_%_G1_Young_Generation], Time(%), 0.0624157195145444
[TOTAL_GCS_G1_Old_Generation], Count, 0
[TOTAL_GC_TIME_G1_Old_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Old_Generation], Time(%), 0.0
[TOTAL_GCs], Count, 3
[TOTAL_GC_TIME], Time(ms), 81
[TOTAL_GC_TIME_%], Time(%), 0.0624157195145444
[READ], Operations, 1000
[READ], AverageLatency(us), 491786.112
[READ], MinLatency(us), 305408
[READ], MaxLatency(us), 962047
[READ], 95thPercentileLatency(us), 740863
[READ], 99thPercentileLatency(us), 819199
[READ], Return=OK, 1000
[CLEANUP], Operations, 4
[CLEANUP], AverageLatency(us), 1034240.0
[CLEANUP], MinLatency(us), 1033728
[CLEANUP], MaxLatency(us), 1035263
[CLEANUP], 95thPercentileLatency(us), 1035263
[CLEANUP], 99thPercentileLatency(us), 1035263